Documents/Возврат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>Возврат</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиИзделий</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокПродажи</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПродажаИзделий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НоменклатураВозврата</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/Возврат/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ДокПродажиПриИзменении(Элемент)
    ВызватьНаСервере();
	ЗаполнитьТабличнуюЧастьПоПродажномуДокументу();
	Элементы.НоменклатураВозврата.Обновить();
КонецПроцедуры

&НаСервере
Процедура ВызватьНаСервере()
	Если Объект.ДокПродажи <> Неопределено Тогда
		Объект.Клиент = Объект.ДокПродажи.ПолучитьОбъект().Клиент;
		Объект.Склад = Объект.ДокПродажи.ПолучитьОбъект().Склад;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТабличнуюЧастьПоПродажномуДокументу()

	Если Объект.ДокПродажи = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Продажа = Объект.ДокПродажи.ПолучитьОбъект();
	Объект.НоменклатураВозврата.Очистить();

	Для Каждого СтрокаПродажи Из Продажа.ПереченьНоменклатуры Цикл
		НоваяСтрока = Объект.НоменклатураВозврата.Добавить();
		НоваяСтрока.Номенклатура = СтрокаПродажи.Номенклатура;
		НоваяСтрока.Количество = СтрокаПродажи.Количество;
		НоваяСтрока.Цена = СтрокаПродажи.Цена;
		НоваяСтрока.Сумма = СтрокаПродажи.Сумма;
	КонецЦикла;
КонецПроцедуры


&НаКлиенте
Процедура НоменклатураВозвратаКоличествоПриИзменении(Элемент)
	СтрокаТаб = ЭтаФорма.Элементы.НоменклатураВозврата.ТекущиеДанные;
	РаботаСДокументами.РассчетСуммы(СтрокаТаб);
	Элементы.НоменклатураВозврата.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураВозвратаСуммаПриИзменении(Элемент)
	СтрокаТаб = ЭтаФорма.Элементы.НоменклатураВозврата.ТекущиеДанные;
	РаботаСДокументами.РассчетСуммы(СтрокаТаб);
	Элементы.НоменклатураВозврата.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураВозвратаЦенаПриИзменении(Элемент)
	СтрокаТаб = ЭтаФорма.Элементы.НоменклатураВозврата.ТекущиеДанные;
	РаботаСДокументами.РассчетСуммы(СтрокаТаб);
	Элементы.НоменклатураВозврата.Обновить();
КонецПроцедуры
